gicking/STM8_headers/SVD/STM8AF62A9.svd
      </registers>
      <interrupt>
        <name>AWU</name>
        <description>AWU interrupt</description>
        <value>1</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>BEEP</name>
      <baseAddress>0x50F3</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0001</size>
        <usage>registers</usage>
      </addressBlock>
      <description>BEEP</description>
      <groupName>BEEP</groupName>
      <registers>
        <register>
          <name>CSR</name>
          <description>BEEP control/status register</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>BEEPDIV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>BEEPEN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BEEPSEL</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CLK</name>
      <baseAddress>0x50C0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x000E</size>
        <usage>registers</usage>
      </addressBlock>
      <description>CLK</description>
      <groupName>CLK</groupName>
      <registers>
        <register>
          <name>ICKR</name>
          <description>Internal clock control register</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x01</resetValue>
          <fields>
            <field>
              <name>HSIEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDY</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FHW</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSIEN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSIRDY</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWUAH</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECKR</name>
          <description>External clock control register</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HSEEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDY</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSR</name>
          <description>Clock master status register</description>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0xE1</resetValue>
          <fields>
            <field>
              <name>CKM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWR</name>
          <description>Clock master switch register</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0xE1</resetValue>
          <fields>
            <field>
              <name>SWI</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWCR</name>
          <description>Clock switch control register</description>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>SWBSY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWEN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWIEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWIF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CKDIVR</name>
          <description>Clock divider register</description>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0x14</resetValue>
          <fields>
            <field>
              <name>CPUDIV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>HSIDIV</name>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCKENR1</name>
          <description>Peripheral clock gating register 1</description>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>PCKEN1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSSR</name>
          <description>Clock security system register</description>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CSSEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUX</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSDIE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSD</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCOR</name>
          <description>Configurable clock control register</description>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CCOEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCOSEL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCORDY</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCOBSY</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCKENR2</name>
          <description>Peripheral clock gating register 2</description>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>PCKEN2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSITRIMR</name>
          <description>HSI clock calibration trimming register</description>
          <addressOffset>0x000C</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HSITRIM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIMCCR</name>
          <description>SWIM clock control register</description>
          <addressOffset>0x000D</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>SWIMCLK</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
